{
  "title": "The Lord of the Rings: The Return of the King", 
  "release_date": "2003-12-01", 
  "poster_path": "/uexxR7Kw1qYbZk0RYaF9Rx5ykbj.jpg", 
  "overview": "Aragorn is revealed as the heir to the ancient kings as he, Gandalf and the other members of the broken fellowship struggle to save Gondor from Sauron's forces. Meanwhile, Frodo and Sam bring the ring closer to the heart of Mordor, the dark lord's realm.", 
  "vote_average": 8.2, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}

{
  "title": "Transformers: Age of Extinction", 
  "release_date": "2014-06-25", 
  "poster_path": "/ykIZB9dYBIKV13k5igGFncT5th6.jpg",
  "overview": "As humanity picks up the pieces, following the conclusion of \"Transformers: Dark of the Moon,\" Autobots and Decepticons have all but vanished from the face of the planet. However, a group of powerful, ingenious businessman and scientists attempt to learn from past Transformer incursions and push the boundaries of technology beyond what they can control - all while an ancient, powerful Transformer menace sets Earth in his cross-hairs.",
  "vote_average": 5.8, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}

{
  "title": "The Wolf of Wall Street", 
  "release_date": "2013-12-25", 
  "poster_path": "/vK1o5rZGqxyovfIhZyMELhk03wO.jpg", 
  "overview": "A New York stockbroker refuses to cooperate in a large securities fraud case involving corruption on Wall Street, corporate banking world and mob infiltration. Based on Jordan Belfort's autobiography.", 
  "vote_average": 8.2, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}

{
  "title": "Valerian and the City of a Thousand Planets", 
  "release_date": "2017-07-20", 
  "poster_path": "/jfIpMh79fGRqYJ6PwZLCntzgxlF.jpg", 
  "overview": "In the 28th century, Valerian and Laureline are special operatives charged with keeping order throughout the human territories. On assignment from the Minister of Defense, the two undertake a mission to Alpha, an ever-expanding metropolis where species from across the universe have converged over centuries to share knowledge, intelligence, and cultures. At the center of Alpha is a mysterious dark force which threatens the peaceful existence of the City of a Thousand Planets, and Valerian and Laureline must race to identify the menace and safeguard not just Alpha, but the future of the universe.", 
  "vote_average": 6.6, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}

{
  "title": "Edge of Tomorrow", 
  "release_date": "2014-05-27", 
  "poster_path": "/tpoVEYvm6qcXueZrQYJNRLXL88s.jpg", 
  "overview": "Major Bill Cage is an officer who has never seen a day of combat when he is unceremoniously demoted and dropped into combat. Cage is killed within minutes, managing to take an alpha alien down with him. He awakens back at the beginning of the same day and is forced to fight and die again... and again - as physical contact with the alien has thrown him into a time loop.", 
  "vote_average": 6.5, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}

{
  "title": "Wonder Woman", 
  "release_date": "2017-05-30", 
  "poster_path":  "/imekS7f1OuHyUP2LAiTEM0zBzUz.jpg", 
  "overview": "An Amazon princess comes to the world of Man in the grips of the First World War to confront the forces of evil and bring an end to human conflict.", 
  "vote_average": 7.2, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}

{
  "title": "Inception", 
  "release_date": "2010-07-14", 
  "poster_path":  "/qmDpIHrmpJINaRKAfWQfftjCdyi.jpg", 
  "overview":  "Cobb, a skilled thief who commits corporate espionage by infiltrating the subconscious of his targets is offered a chance to regain his old life as payment for a task considered to be impossible: \"inception\", the implantation of another person's idea into a target's subconscious.", 
  "vote_average": 8.1, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}

{
  "title": "Inception", 
  "release_date": "2010-07-14", 
  "poster_path":  "/qmDpIHrmpJINaRKAfWQfftjCdyi.jpg", 
  "overview":  "Cobb, a skilled thief who commits corporate espionage by infiltrating the subconscious of his targets is offered a chance to regain his old life as payment for a task considered to be impossible: \"inception\", the implantation of another person's idea into a target's subconscious.", 
  "vote_average": 8.1, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}

{
  "title": "Terminator Genisys", 
  "release_date": "2015-06-23", 
  "poster_path":  "/5JU9ytZJyR3zmClGmVm9q4Geqbd.jpg", 
  "overview":  "The year is 2029. John Connor, leader of the resistance continues the war against the machines. At the Los Angeles offensive, John's fears of the unknown future begin to emerge when TECOM spies reveal a new plot by SkyNet that will attack him from both fronts; past and future, and will ultimately change warfare forever.", 
  "vote_average": 5.8, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}

{
  "title": "Harry Potter and the Half-Blood Prince", 
  "release_date": "2009-07-07", 
  "poster_path":  "/bFXys2nhALwDvpkF3dP3Vvdfn8b.jpg", 
  "overview":  "As Harry begins his sixth year at Hogwarts, he discovers an old book marked as 'Property of the Half-Blood Prince', and begins to learn more about Lord Voldemort's dark past.", 
  "vote_average": 7.5, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}

{
  "title": "The Curious Case of Benjamin Button", 
  "release_date": "2008-11-24", 
  "poster_path":  "/4O4INOPtWTfHq3dd5vYTPV0TCwa.jpg", 
  "overview":  "Tells the story of Benjamin Button, a man who starts aging backwards with bizarre consequences.", 
  "vote_average": 7.5, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}

{
  "title": "Shrek the Third", 
  "release_date": "2007-05-17", 
  "poster_path":  "/lA17Mlz8hXVZsW5Y3WuUa8KPilQ.jpg", 
  "overview":  "The King of Far Far Away has died and Shrek and Fiona are to become King &amp; Queen. However, Shrek wants to return to his cozy swamp and live in peace and quiet, so when he finds out there is another heir to the throne, they set off to bring him back to rule the kingdom.", 
  "vote_average": 7.5, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}

{
  "title": "About Time", 
  "release_date": "2013-08-16", 
  "poster_path":  "/zSuh8dGwqpsWR7ccvYbfxbSZ37o.jpg", 
  "overview":  "The night after another unsatisfactory New Year party, Tim's father tells his son that the men in his family have always had the ability to travel through time. Tim can't change history, but he can change what happens and has happened in his own life – so he decides to make his world a better place... by getting a girlfriend. Sadly, that turns out not to be as easy as he thinks.", 
  "vote_average": 7.8, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}

{
  "title": "Captain America: The First Avenger", 
  "release_date": "2011-07-22", 
  "poster_path":  "/vSNxAJTlD0r02V9sPYpOjqDZXUK.jpg",
  "overview":  "Predominantly set during World War II, Steve Rogers is a sickly man from Brooklyn who's transformed into super-soldier Captain America to aid in the war effort. Rogers must stop the Red Skull – Adolf Hitler's ruthless head of weaponry, and the leader of an organization that intends to use a mysterious device of untold powers for world domination.", 
  "vote_average": 6.6, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}

{
  "title": "Underworld", 
  "release_date": "2003-09-19", 
  "poster_path":  "/rdkxl5iXdpVU188cL1LLG3sy6z4.jpg",
  "overview":  "Vampires and werewolves have waged a nocturnal war against each other for centuries. But all bets are off when a female vampire warrior named Selene, who's famous for her strength and werewolf-hunting prowess, becomes smitten with a peace-loving male werewolf, Michael, who wants to end the war.", 
  "vote_average": 6.6, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}


{
  "title": "The Simpsons Movie", 
  "release_date": "2007-07-25", 
  "poster_path":  "/eCytnEriVur3rT47NWfkgPXD9qs.jpg",
  "overview":  "Vampires and werewolves have waged a nocturnal war against each other for centuries. But all bets are off when a female vampire warrior named Selene, who's famous for her strength and werewolf-hunting prowess, becomes smitten with a peace-loving male werewolf, Michael, who wants to end the war.", 
  "vote_average": 6.9, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}

{
  "title": "Independence Day: Resurgence", 
  "release_date": "2012-03-12", 
  "poster_path":  "/5CHJs479xWnm3zMDOl94VkKS7MZ.jpg",
  "overview":  "We always knew they were coming back. Using recovered alien technology, the nations of Earth have collaborated on an immense defense program to protect the planet. But nothing can prepare us for the aliens’ advanced and unprecedented force. Only the ingenuity of a few brave men and women can bring our world back from the brink of extinction.", 
  "vote_average": 5, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}

{
  "title": "Avengers: Age of Ultron", 
  "release_date": "2015-04-22", 
  "poster_path":  "/vXIrvKadue7GdySiVh3huoQZiMi.jpg",
  "overview":  "When Tony Stark tries to jumpstart a dormant peacekeeping program, things go awry and Earth’s Mightiest Heroes are put to the ultimate test as the fate of the planet hangs in the balance. As the villainous Ultron emerges, it is up to The Avengers to stop him from enacting his terrible plans, and soon uneasy alliances and unexpected action pave the way for an epic and unique global adventure.", 
  "vote_average": 7.3, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}


{
  "title": "Avatar", 
  "release_date": "2009-12-10", 
  "poster_path":  "/kmcqlZGaSh20zpTbuoF0Cdn07dT.jpg",
  "overview":  "In the 22nd century, a paraplegic Marine is dispatched to the moon Pandora on a unique mission, but becomes torn between following orders and protecting an alien civilization.", 
  "vote_average": 7.2, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}

{
  "title": "Creed", 
  "release_date": "2009-12-10", 
  "poster_path":  "/hKzhV274pkZBSpXfCjUyzbyYKLl.jpg",
  "overview":  "The former World Heavyweight Champion Rocky Balboa serves as a trainer and mentor to Adonis Johnson, the son of his late friend and former rival Apollo Creed.", 
  "vote_average": 7.3, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}

{
  "title": "Pulp Fiction", 
  "release_date": "1994-09-10", 
  "poster_path":  "/dM2w364MScsjFf8pfMbaWUcWrR.jpg",
  "overview":  "A burger-loving hit man, his philosophical partner, a drug-addled gangster's moll and a washed-up boxer converge in this sprawling, comedic crime caper. Their adventures unfurl in three stories that ingeniously trip back and forth in time.", 
  "vote_average": 7.3, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}

{
  "title": "The Hobbit: The Battle of the Five Armies", 
  "release_date": "2014-12-10", 
  "poster_path":  "/dM2w364MScsjFf8pfMbaWUcWrR.jpg",
  "overview":  "Immediately after the events of The Desolation of Smaug, Bilbo and the dwarves try to defend Erebor's mountain of treasure from others who claim it: the men of the ruined Laketown and the elves of Mirkwood. Meanwhile an army of Orcs led by Azog the Defiler is marching on Erebor, fueled by the rise of the dark lord Sauron. Dwarves, elves and men must unite, and the hope for Middle-Earth falls into Bilbo's hands.", 
  "vote_average": 7.2, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}

{
  "title": "The Godfather", 
  "release_date": "1972-03-14", 
  "poster_path":  "/rPdtLWNsZmAtoZl9PK7S2wE3qiS.jpg",
  "overview":  "Spanning the years 1945 to 1955, a chronicle of the fictional Italian-American Corleone crime family. When organized crime family patriarch, Vito Corleone barely survives an attempt on his life, his youngest son, Michael steps in to take care of the would-be killers, launching a campaign of bloody revenge.", 
  "vote_average": 7.2, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}

{
  "title": "The Lion King", 
  "release_date": "1994-06-23", 
  "poster_path":  "/bKPtXn9n4M4s8vvZrbw40mYsefB.jpg",
  "overview":  "A young lion cub named Simba can't wait to be king. But his uncle craves the title for himself and will stop at nothing to get it.", 
  "vote_average": 8, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}

{
  "title": "Rogue One: A Star Wars Story", 
  "release_date": "2016-12-14", 
  "poster_path":  "/bKPtXn9n4M4s8vvZrbw40mYsefB.jpg",
  "overview":  "A rogue band of resistance fighters unite for a mission to steal the Death Star plans and bring a new hope to the galaxy.", 
  "vote_average": 7.4, 
  "netflix": true,
  "amazon": false,
  "hbo": true,
  "hulu": false
}

















































